test/performance/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up phase"
    - duration: 300
      arrivalRate: 50
      name: "Normal load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  processor: "./load-test-processor.js"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Authentication Flow"
    weight: 20
    flow:
      - post:
          url: "/api/v1/auth/register"
          json:
            name: "Load Test User {{ $randomString() }}"
            email: "loadtest{{ $randomString() }}@example.com"
            password: "LoadTestPassword123!"
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "loadtest{{ $randomString() }}@example.com"
            password: "LoadTestPassword123!"

  - name: "Order Search"
    weight: 40
    flow:
      - get:
          url: "/api/v1/orders/search"
          qs:
            status: "PUBLISHED"
            page: 1
            limit: 20

  - name: "Get User Profile"
    weight: 20
    flow:
      - get:
          url: "/api/v1/users/me"
          headers:
            Authorization: "Bearer {{ token }}"

  - name: "Get Categories"
    weight: 20
    flow:
      - get:
          url: "/api/v1/categories/public"